# Migración de datos de MySql a SQL Server

### Primero hay que hacer las conexiones a las bases de datos

In [ ]:
import pandas as pd
from sqlalchemy import create_engine
import pyodbc
from shapely import wkb

mySqlConn = None
tSqlConn = None

def connectToDatabases():
    global mySqlConn, tSqlConn
    try:
        
        # Conectarse a MySQL
        mySqlConn = create_engine("mysql+mysqlconnector://root:123456@localhost/pay_assistant_db")

        # Conectarse a SQL Server con pyodbc
        tSqlConn = pyodbc.connect(
            'DRIVER={ODBC Driver 17 for SQL Server};'
            'SERVER=localhost;'
            'DATABASE=solturaDB;'
            'Trusted_Connection=yes;'
        )

        
        print("Éxito al conectarse!")


        # Conectarse a SQL Server
        # TODO
    
    except Exception as e:   
        print (f"Error: {e}")

In [277]:
connectToDatabases()

Éxito al conectarse!

### Una vez hechas las conexiones, se va a extraer todos los datos de mysql a migrar

In [280]:
# Instanciar las variables globales de las tablas con los datos a migrar
df_users = None
df_currencies = None
df_subscriptions = None
df_planPrices = None
df_planFeaturesSubscriptions = None
df_planFeatures = None
df_schedules = None
df_scheduleDetails = None
df_userPlanPrices = None
df_countries = None
df_states = None
df_cities = None
df_addresses = None
df_userAddresses = None

In [282]:
# Esta función hace todos los queries de las tablas y los guarda en DataFrames
def extractAllData():
    global df_users, df_currencies, df_subscriptions, df_planPrices,df_planFeatures, df_planFeaturesSubscriptions, df_schedules, df_scheduleDetails, df_userPlanPrices, df_countries
    global df_cities, df_states, df_addresses, df_userAddresses
    df_users = pd.read_sql("SELECT * FROM pay_users;",mySqlConn)
    df_currencies = pd.read_sql("SELECT * FROM pay_currencies;",mySqlConn)
    df_subscriptions = pd.read_sql("SELECT * FROM pay_subscriptions;",mySqlConn)
    df_planPrices = pd.read_sql("SELECT * FROM pay_plan_prices;",mySqlConn)
    df_planFeaturesSubscriptions = pd.read_sql("SELECT * FROM pay_plan_features_subscriptions;",mySqlConn)
    df_planFeatures = pd.read_sql("SELECT * FROM pay_plan_features;",mySqlConn)
    df_schedules = pd.read_sql("SELECT * FROM pay_schedules;",mySqlConn)
    df_scheduleDetails = pd.read_sql("SELECT * FROM pay_schedules_details;",mySqlConn)
    df_userPlanPrices = pd.read_sql("SELECT * FROM pay_users_plan_prices;",mySqlConn)
    df_countries = pd.read_sql("SELECT * FROM pay_countries;",mySqlConn)
    df_states = pd.read_sql("SELECT * FROM pay_states;",mySqlConn)
    df_cities = pd.read_sql("SELECT * FROM pay_city;",mySqlConn)
    df_addresses = pd.read_sql("SELECT * FROM pay_addresses;",mySqlConn)
    df_userAddresses = pd.read_sql("SELECT * FROM pay_users_adresses;",mySqlConn)

In [284]:
# Ahora se llama la función para meter todos los datos en los dataFrame
extractAllData()

In [290]:
# Esta función lo que hace es preparar el geoposition para insertarlo en SQL Server
def parse_mysql_point(blob):
    if pd.isna(blob):
        return None
    try:
        return wkb.loads(blob[4:]).wkt  # saltar primeros 4 bytes (SRID)
    except Exception as e:
        print("Error con blob:", blob)
        return None

df_addresses['geoposition'] = df_addresses['geoposition'].apply(parse_mysql_point)

# Tablas a migrar

Tablas de usuarios:
- users
- userAddresses

Tablas de países:
- countries
- states
- cities

Tablas de direcciones:
- addresses

Tablas de schedules:
- schedules
- scheduleDetails

# Tablas a adaptar
Todo lo que involucra los planes, sus features y precios

### En esta parte se pueden ver los valores de las tablas al extraerse del MySql

In [286]:
df_users

,user_id,email,first_name,last_name,password,enabled
0,1,PaulaPonce1@gmail.com,Paula,Ponce,b'2bf5309e56428a57f073efd97e7668a08cfc74db0a44...,1
1,2,EmmaRamos2@gmail.com,Emma,Ramos,b'48e217aeaa990fa02a72367bda2ab6aeb77e87c9b4f4...,1
2,3,RicardoSalazar3@gmail.com,Ricardo,Salazar,b'228b4b3c75ace3216c8189a12cca88befb322d9696c2...,1
3,4,AnaGarcía4@gmail.com,Ana,García,b'0c44f0413a7351ae8a456633b6512797ea4cb515fa29...,1
4,5,MartaMejía5@gmail.com,Marta,Mejía,b'43fa4a3e9cdd525128edaa7b7b7fd330f41d3aeb44c2...,1
...,...,...,...,...,...,...
1045,1046,CamilaAcosta1046@gmail.com,Camila,Acosta,b'13a33a2c53304fffac7614be31a4bfe851f8a6d9f439...,1
1046,1047,LorenaRamírez1047@gmail.com,Lorena,Ramírez,b'850b066ee061196ac4ed3b237979a7197fa506228af5...,1
1047,1048,FranciscoEstrada1048@gmail.com,Francisco,Estrada,b'288d77e654df324e0d688d227f806c74034c3254792d...,1
1048,1049,JavierGuerrero1049@gmail.com,Javier,Guerrero,b'bd469a97a827aec59ef3593118fb364a0af0db1558f6...,1
1049,1050,ElenaFigueroa1050@gmail.com,Elena,Figueroa,b'21a6cffef3fce12cf6ed2a3ff79ade9ff80b4678fe77...,1

In [76]:
df_currencies

   currency_id                  name acronym symbol  country_id
0            1   Colón Costarricense     CRC      ₡           1
1            2  Dólar Estadounidense     USD      $           2

In [62]:
df_subscriptions

   subscription_id description
0                1    Estándar
1                2     Premium

In [17]:
df_planPrices

,plan_prices_id,subscrition_Id,amount,currency_id,postTime,endDate,current
0,1,1,9.99,2,2025-04-30 06:06:52,2025-12-31,1
1,2,2,39.99,2,2025-04-30 06:06:52,2025-12-31,1

In [66]:
df_planFeaturesSubscriptions

   plan_features_id  subscription_id value  enabled
0                 1                1    No        1
1                 1                2    Sí        1
2                 2                1    50        1
3                 2                2   200        1
4                 3                1     5        1

In [10]:
df_schedules

,schedule_id,name,repit,repetitions,recurrencyType,endDate,startDate
0,1,Pago Estándar Mensual,1,12,1,None,2025-04-30 06:06:52
1,2,Pago Premium Anual,0,1,2,None,2025-04-30 06:06:52

In [70]:
df_scheduleDetails

,schedules_details_id,deleted,schedule_id,baseDate,datePart,last_execute,next_execute,description,detail
0,1,0,1,2025-04-30 06:06:52,2025-01-01,None,2025-02-01,Pago mensual,Pago mensual de la suscripción Estándar
1,2,0,2,2025-04-30 06:06:52,2025-01-01,None,2026-01-01,Pago anual,Pago anual de la suscripción Premium

In [72]:
df_userPlanPrices

,user_plan_price_id,user_id,plan_prices_id,adquision,enabled,schedule_id
0,1,1,1,2025-03-28,1,1
1,2,2,1,2025-03-19,1,1
2,3,3,1,2025-04-16,1,1
3,4,4,1,2025-03-16,1,1
4,5,5,1,2025-02-08,1,1
...,...,...,...,...,...,...
1045,1046,1046,2,2025-03-12,1,2
1046,1047,1047,2,2025-04-25,1,2
1047,1048,1048,2,2025-02-12,1,2
1048,1049,1049,2,2025-02-16,1,2
1049,1050,1050,2,2025-03-25,1,2

In [74]:
df_countries

   country_id            name
0           1      Costa Rica
1           2  Estados Unidos
2           3          España
3           4          México
4           5       Argentina
5           6           Chile
6           7        Colombia
7           8            Perú
8           9          Brasil
9          10         Francia

In [76]:
df_states

   state_id          name  country_id
0         1       Cartago           1
1         2      Alajuela           1
2         3       Florida           2
3         4         Texas           2
4         5  Buenos Aires           5
5         6       Córdoba           5
6         7        Madrid           3
7         8     Barcelona           3
8         9     São Paulo           9
9        10          Lima           8

In [17]:
df_cities

   city_id  state_id              name
0        1         1           Parrita
1        2         2         Santa Ana
2        3         3             Miami
3        4         4            Austin
4        5         5     Mar del Plata
5        6         6  Villa Carlos Paz
6        7         7           Sevilla
7        8         8            Sitges
8        9         9          Campinas
9       10        10          Arequipa

In [292]:
df_addresses

,address_id,line1,line2,zipcode,geoposition,city_id
0,1,Calle 1 #41,None,47290,POINT (-69.62084863299583 -126.94687827205927),4
1,2,Calle 2 #54,None,52776,POINT (-88.69406578940718 -16.93732734484351),3
2,3,Calle 3 #85,None,55158,POINT (-55.874011596547454 -74.45279361163527),9
3,4,Calle 4 #60,None,33987,POINT (68.49769187951244 -42.08641244292858),3
4,5,Calle 5 #21,None,27804,POINT (41.487150202958986 114.58411422985057),9
...,...,...,...,...,...,...
1045,1046,Calle 1046 #32,None,99560,POINT (89.94139725336936 -175.85387046994072),1
1046,1047,Calle 1047 #25,None,11560,POINT (54.58595212976073 61.00499924365897),10
1047,1048,Calle 1048 #67,None,58368,POINT (68.52666878935571 54.87802851468143),7
1048,1049,Calle 1049 #14,None,85524,POINT (62.45690672887201 60.890862868065824),9
1049,1050,Calle 1050 #1,None,66755,POINT (-38.03628076616328 -21.324578748386898),4

In [82]:
df_userAddresses

     user_address_id  user_id  address_id  enabled
0                  1        1           1        1
1                  2        2           2        1
2                  3        3           3        1
3                  4        4           4        1
4                  5        5           5        1
..               ...      ...         ...      ...
995              996      996         996        1
996              997      997         997        1
997              998      998         998        1
998              999      999         999        1
999             1000     1000        1000        1

[1000 rows x 4 columns]

In [294]:
# Cursor para ejecutar los queries e inserts de SQL Server
cursor = tSqlConn.cursor()

In [296]:
# Migrar los usuarios y conseguir los IDs del TSQL

# Crear una tabla para tener los viejos userIDs y los nuevos para sustituirlos luego en las otras tablas 
userIDMap = pd.DataFrame(columns = ["oldUserID","newUserID"])

# Insertar uno por uno cada usuario
for index, row in df_users.iterrows():
    try:
        oldUserID = row["user_id"]

        # Insertar con OUTPUT para recuperar el userID generado
        cursor.execute("""
            INSERT INTO solturaDB.sol_users(email, firstName, lastName, password)
            OUTPUT INSERTED.userID
            VALUES (?, ?, ?, ?);
        """, (row["email"], row["first_name"], row["last_name"], row["password"]))
        
        # Recuperar el nuevo userID desde la salida del query
        newUserID = cursor.fetchone()[0]

        # Guarda el nuevo y viejo userID
        userIDMap.loc[len(userIDMap)] = [oldUserID, newUserID]
        # Cambia el userID para saber el nuevo userID del usuario en SQL Server
        df_users.at[index, "user_id"] = newUserID

        # Insertar al usuario nuevo a una tabla auxiliar que indique que es usuario del app assistant y no ha cambiado su contraseña
        cursor.execute("""
            INSERT INTO dbo.sol_migratedUsers(userID, platform, changedPassword)
            VALUES (?, ?, ?);
        """, (newUserID, "Payment Assistant", 0))

    except Exception as e:
        print(f"Error migrando usuario {oldUserID}: {e}")
# Hacer el commit de todo al final                   
tSqlConn.commit()

In [297]:
# Crear un diccionario de los IDs para remplazar los user_id en tablas que lo ocupan como FK
idMap = dict(zip(userIDMap["oldUserID"], userIDMap["newUserID"]))

df_userAddresses["user_id"] = df_userAddresses["user_id"].map(idMap)
df_userPlanPrices["user_id"] = df_userPlanPrices["user_id"].map(idMap)

In [ ]:
# Ver la tabla de userIDs nuevos y viejos
userIDMap

In [25]:
# Usuarios antes
df_users

,user_id,email,first_name,last_name,password,enabled
0,1,PaulaPonce1@gmail.com,Paula,Ponce,b'2bf5309e56428a57f073efd97e7668a08cfc74db0a44...,1
1,2,EmmaRamos2@gmail.com,Emma,Ramos,b'48e217aeaa990fa02a72367bda2ab6aeb77e87c9b4f4...,1
2,3,RicardoSalazar3@gmail.com,Ricardo,Salazar,b'228b4b3c75ace3216c8189a12cca88befb322d9696c2...,1
3,4,AnaGarcía4@gmail.com,Ana,García,b'0c44f0413a7351ae8a456633b6512797ea4cb515fa29...,1
4,5,MartaMejía5@gmail.com,Marta,Mejía,b'43fa4a3e9cdd525128edaa7b7b7fd330f41d3aeb44c2...,1
...,...,...,...,...,...,...
1045,1046,CamilaAcosta1046@gmail.com,Camila,Acosta,b'13a33a2c53304fffac7614be31a4bfe851f8a6d9f439...,1
1046,1047,LorenaRamírez1047@gmail.com,Lorena,Ramírez,b'850b066ee061196ac4ed3b237979a7197fa506228af5...,1
1047,1048,FranciscoEstrada1048@gmail.com,Francisco,Estrada,b'288d77e654df324e0d688d227f806c74034c3254792d...,1
1048,1049,JavierGuerrero1049@gmail.com,Javier,Guerrero,b'bd469a97a827aec59ef3593118fb364a0af0db1558f6...,1
1049,1050,ElenaFigueroa1050@gmail.com,Elena,Figueroa,b'21a6cffef3fce12cf6ed2a3ff79ade9ff80b4678fe77...,1

In [25]:
# Usuarios después
df_users

,user_id,email,first_name,last_name,password,enabled
0,3,PaulaPonce1@gmail.com,Paula,Ponce,b'2bf5309e56428a57f073efd97e7668a08cfc74db0a44...,1
1,4,EmmaRamos2@gmail.com,Emma,Ramos,b'48e217aeaa990fa02a72367bda2ab6aeb77e87c9b4f4...,1
2,5,RicardoSalazar3@gmail.com,Ricardo,Salazar,b'228b4b3c75ace3216c8189a12cca88befb322d9696c2...,1
3,6,AnaGarcía4@gmail.com,Ana,García,b'0c44f0413a7351ae8a456633b6512797ea4cb515fa29...,1
4,7,MartaMejía5@gmail.com,Marta,Mejía,b'43fa4a3e9cdd525128edaa7b7b7fd330f41d3aeb44c2...,1
...,...,...,...,...,...,...
1045,1048,CamilaAcosta1046@gmail.com,Camila,Acosta,b'13a33a2c53304fffac7614be31a4bfe851f8a6d9f439...,1
1046,1049,LorenaRamírez1047@gmail.com,Lorena,Ramírez,b'850b066ee061196ac4ed3b237979a7197fa506228af5...,1
1047,1050,FranciscoEstrada1048@gmail.com,Francisco,Estrada,b'288d77e654df324e0d688d227f806c74034c3254792d...,1
1048,1051,JavierGuerrero1049@gmail.com,Javier,Guerrero,b'bd469a97a827aec59ef3593118fb364a0af0db1558f6...,1
1049,1052,ElenaFigueroa1050@gmail.com,Elena,Figueroa,b'21a6cffef3fce12cf6ed2a3ff79ade9ff80b4678fe77...,1

In [35]:
# Ver las tablas actualizadas de df_userAddresses y df_userPlanPrices
df_userAddresses

     user_address_id  user_id  address_id  enabled
0                  1        3           1        1
1                  2        4           2        1
2                  3        5           3        1
3                  4        6           4        1
4                  5        7           5        1
..               ...      ...         ...      ...
995              996      998         996        1
996              997      999         997        1
997              998     1000         998        1
998              999     1001         999        1
999             1000     1002        1000        1

[1000 rows x 4 columns]

In [34]:
df_userPlanPrices

,user_plan_price_id,user_id,plan_prices_id,adquision,enabled,schedule_id
0,1,3,1,2025-03-28,1,1
1,2,4,1,2025-03-19,1,1
2,3,5,1,2025-04-16,1,1
3,4,6,1,2025-03-16,1,1
4,5,7,1,2025-02-08,1,1
...,...,...,...,...,...,...
1045,1046,1048,2,2025-03-12,1,2
1046,1047,1049,2,2025-04-25,1,2
1047,1048,1050,2,2025-02-12,1,2
1048,1049,1051,2,2025-02-16,1,2
1049,1050,1052,2,2025-03-25,1,2

## Migración de países, estados y ciudades

### Países

In [302]:
countryIDMap = pd.DataFrame(columns=["oldCountryID", "newCountryID"])

for index, row in df_countries.iterrows():
    cursor.execute("SELECT countryID FROM solturaDB.sol_countries WHERE name = ?", row["name"])
    result = cursor.fetchone()

    if result:
        newID = result[0]
    else:
        cursor.execute("""
            INSERT INTO solturaDB.sol_countries(name)
            OUTPUT INSERTED.countryID
            VALUES (?);
        """, row["name"])
        newID = cursor.fetchone()[0]
    
    countryIDMap.loc[len(countryIDMap)] = [row["country_id"], newID]
    df_countries.at[index, "country_id"] = newID

tSqlConn.commit()

In [304]:
# Crear un diccionario de los IDs para remplazar los viejos por de los insertados
mapCountries = dict(zip(countryIDMap["oldCountryID"], countryIDMap["newCountryID"]))

df_states["country_id"] = df_states["country_id"].map(mapCountries)
df_currencies["country_id"] = df_currencies["country_id"].map(mapCountries)

### Vista de los datos actualizados

In [ ]:
countryIDMap

In [27]:
# Países antes
df_countries

   country_id            name
0           1      Costa Rica
1           2  Estados Unidos
2           3          España
3           4          México
4           5       Argentina
5           6           Chile
6           7        Colombia
7           8            Perú
8           9          Brasil
9          10         Francia

In [45]:
# Países después
df_countries

   country_id            name
0           1      Costa Rica
1           2  Estados Unidos
2           4          España
3           3          México
4           5       Argentina
5           6           Chile
6           7        Colombia
7           8            Perú
8           9          Brasil
9          10         Francia

In [29]:
# Estados antes
df_states

   state_id          name  country_id
0         1       Cartago           1
1         2      Alajuela           1
2         3       Florida           2
3         4         Texas           2
4         5  Buenos Aires           5
5         6       Córdoba           5
6         7        Madrid           3
7         8     Barcelona           3
8         9     São Paulo           9
9        10          Lima           8

In [47]:
# Estados después
df_states

   state_id          name  country_id
0         1       Cartago           1
1         2      Alajuela           1
2         3       Florida           2
3         4         Texas           2
4         5  Buenos Aires           5
5         6       Córdoba           5
6         7        Madrid           4
7         8     Barcelona           4
8         9     São Paulo           9
9        10          Lima           8

### Estados

In [308]:
stateIDMap = pd.DataFrame(columns=["oldStateID", "newStateID"])

for index, row in df_states.iterrows():
    
    cursor.execute("""
        SELECT stateID FROM solturaDB.sol_states 
        WHERE name = ? AND countryID = ?
    """,  (str(row["name"]), int(row["country_id"])))
    result = cursor.fetchone()
    
    if result:
        newID = result[0]
    else:
        cursor.execute("""
            INSERT INTO solturaDB.sol_states(name, countryID)
            OUTPUT INSERTED.stateID
            VALUES (?, ?);
        """,  (str(row["name"]), int(row["country_id"])))
        newID = cursor.fetchone()[0]
    
    stateIDMap.loc[len(stateIDMap)] = [row["state_id"], int(newID)]
    df_states.at[index, "state_id"] = newID

tSqlConn.commit()

In [310]:
mapStates = dict(zip(stateIDMap["oldStateID"], stateIDMap["newStateID"]))
df_cities["state_id"] = df_cities["state_id"].map(mapStates)

### Vista de los datos actualizados

In [174]:
stateIDMap

   oldStateID  newStateID
0           1           3
1           2           2
2           3          10
3           4           9
4           5          18
5           6          19
6           7          15
7           8          16
8           9          20
9          10          21

In [21]:
# Estados antes
df_states

   state_id          name  country_id
0         1       Cartago           1
1         2      Alajuela           1
2         3       Florida           2
3         4         Texas           2
4         5  Buenos Aires           5
5         6       Córdoba           5
6         7        Madrid           3
7         8     Barcelona           3
8         9     São Paulo           9
9        10          Lima           8

In [47]:
# Estados después
df_states

   state_id          name  country_id
0         3       Cartago           1
1         2      Alajuela           1
2        10       Florida           2
3         9         Texas           2
4        18  Buenos Aires           5
5        19       Córdoba           5
6        15        Madrid           4
7        16     Barcelona           4
8        20     São Paulo           9
9        21          Lima           8

In [23]:
# Ciudades antes
df_cities

   city_id  state_id              name
0        1         1           Parrita
1        2         2         Santa Ana
2        3         3             Miami
3        4         4            Austin
4        5         5     Mar del Plata
5        6         6  Villa Carlos Paz
6        7         7           Sevilla
7        8         8            Sitges
8        9         9          Campinas
9       10        10          Arequipa

In [49]:
# Ciudades después
df_cities

   city_id  state_id              name
0        1         3           Parrita
1        2         2         Santa Ana
2        3        10             Miami
3        4         9            Austin
4        5        18     Mar del Plata
5        6        19  Villa Carlos Paz
6        7        15           Sevilla
7        8        16            Sitges
8        9        20          Campinas
9       10        21          Arequipa

### Ciudades

In [312]:
cityIDMap = pd.DataFrame(columns=["oldCityID", "newCityID"])

for index, row in df_cities.iterrows():
    
    cursor.execute("""
        SELECT cityID FROM solturaDB.sol_city
        WHERE name = ? AND stateID = ?
    """, (row["name"], row["state_id"]))
    result = cursor.fetchone()

    if result:
        newID = result[0]
    else:
        cursor.execute("""
            INSERT INTO solturaDB.sol_city(name, stateID)
            OUTPUT INSERTED.cityID
            VALUES (?, ?);
        """, (row["name"], row["state_id"]))
        newID = cursor.fetchone()[0]

    cityIDMap.loc[len(cityIDMap)] = [row["city_id"], newID]
    df_cities.at[index, "city_id"] = newID

tSqlConn.commit()

In [314]:
mapCities = dict(zip(cityIDMap["oldCityID"], cityIDMap["newCityID"]))
df_addresses["city_id"] = df_addresses["city_id"].map(mapCities)

### Vista de los datos actualizados

In [316]:
cityIDMap

   oldCityID  newCityID
0          1         16
1          2         17
2          3         18
3          4         19
4          5         20
5          6         21
6          7         22
7          8         23
8          9         24
9         10         25

In [33]:
# Ciudades antes
df_cities

   city_id  state_id              name
0        1         1           Parrita
1        2         2         Santa Ana
2        3         3             Miami
3        4         4            Austin
4        5         5     Mar del Plata
5        6         6  Villa Carlos Paz
6        7         7           Sevilla
7        8         8            Sitges
8        9         9          Campinas
9       10        10          Arequipa

In [318]:
# Ciudades después
df_cities

   city_id  state_id              name
0       16         3           Parrita
1       17         2         Santa Ana
2       18        10             Miami
3       19         9            Austin
4       20        18     Mar del Plata
5       21        19  Villa Carlos Paz
6       22        15           Sevilla
7       23        16            Sitges
8       24        20          Campinas
9       25        21          Arequipa

In [182]:
# Addresses antes
df_addresses

,address_id,line1,line2,zipcode,geoposition,city_id
0,1,Calle 1 #41,None,47290,POINT (-69.62084863299583 -126.94687827205927),19
1,2,Calle 2 #54,None,52776,POINT (-88.69406578940718 -16.93732734484351),18
2,3,Calle 3 #85,None,55158,POINT (-55.874011596547454 -74.45279361163527),24
3,4,Calle 4 #60,None,33987,POINT (68.49769187951244 -42.08641244292858),18
4,5,Calle 5 #21,None,27804,POINT (41.487150202958986 114.58411422985057),24
...,...,...,...,...,...,...
1045,1046,Calle 1046 #32,None,99560,POINT (89.94139725336936 -175.85387046994072),16
1046,1047,Calle 1047 #25,None,11560,POINT (54.58595212976073 61.00499924365897),25
1047,1048,Calle 1048 #67,None,58368,POINT (68.52666878935571 54.87802851468143),22
1048,1049,Calle 1049 #14,None,85524,POINT (62.45690672887201 60.890862868065824),24
1049,1050,Calle 1050 #1,None,66755,POINT (-38.03628076616328 -21.324578748386898),19

In [71]:
# Addresses después
df_addresses

,address_id,line1,line2,zipcode,geoposition,city_id
0,1,Calle 1 #41,None,47290,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xf0\x9e...,19
1,2,Calle 2 #54,None,52776,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xae\xb1...,18
2,3,Calle 3 #85,None,55158,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x7f\xbf...,24
3,4,Calle 4 #60,None,33987,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00h\x7f\n/...,18
4,5,Calle 5 #21,None,27804,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00l\xf9\x1...,24
...,...,...,...,...,...,...
1045,1046,Calle 1046 #32,None,99560,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x00\xf1...,16
1046,1047,Calle 1047 #25,None,11560,"b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x04,\xb...",25
1047,1048,Calle 1048 #67,None,58368,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xd4\x86...,22
1048,1049,Calle 1049 #14,None,85524,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xf0\xe9...,24
1049,1050,Calle 1050 #1,None,66755,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x93\x12...,19

## Migración de direcciones y direcciones de usuario

Una vez insertados las ciudades, ya se pueden migrar las direcciones de todos los usuarios

In [320]:
# Crear DataFrame para mapear address_id viejos a nuevos
addressIDMap = pd.DataFrame(columns=["oldAddressID", "newAddressID"])

for index, row in df_addresses.iterrows():
    try:
        oldAddressID = row["address_id"]

        # Insertar la dirección y obtener el nuevo ID generado
        cursor.execute("""
            INSERT INTO solturaDB.sol_addresses(line1, line2, zipcode, geoposition, cityID)
            OUTPUT INSERTED.addressID
            VALUES (?, ?, ?, geometry::STGeomFromText(?, 4326), ?);
        """, (str(row["line1"]), str(row["line2"]) if pd.notna(row["line2"]) else None,
              str(row["zipcode"]), row["geoposition"], row["city_id"]))
        
        newAddressID = cursor.fetchone()[0]

        # Guardar el mapeo
        addressIDMap.loc[len(addressIDMap)] = [oldAddressID, newAddressID]

        # Actualizar el DataFrame original
        df_addresses.at[index, "address_id"] = newAddressID

    except Exception as e:
        print(f"Error migrando dirección {oldAddressID}: {e}")
        break

tSqlConn.commit()

In [321]:
addressMap = dict(zip(addressIDMap["oldAddressID"], addressIDMap["newAddressID"]))
df_userAddresses["address_id"] = df_userAddresses["address_id"].map(addressMap)

### Vista de los datos actualizados

In [188]:
addressIDMap

      oldAddressID  newAddressID
0                1             6
1                2             7
2                3             8
3                4             9
4                5            10
...            ...           ...
1045          1046          1051
1046          1047          1052
1047          1048          1053
1048          1049          1054
1049          1050          1055

[1050 rows x 2 columns]

In [78]:
# Addresses antes
df_addresses

,address_id,line1,line2,zipcode,geoposition,city_id
0,1,Calle 1 #41,None,47290,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xf0\x9e...,19
1,2,Calle 2 #54,None,52776,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xae\xb1...,18
2,3,Calle 3 #85,None,55158,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x7f\xbf...,24
3,4,Calle 4 #60,None,33987,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00h\x7f\n/...,18
4,5,Calle 5 #21,None,27804,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00l\xf9\x1...,24
...,...,...,...,...,...,...
1045,1046,Calle 1046 #32,None,99560,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x00\xf1...,16
1046,1047,Calle 1047 #25,None,11560,"b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x04,\xb...",25
1047,1048,Calle 1048 #67,None,58368,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xd4\x86...,22
1048,1049,Calle 1049 #14,None,85524,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\xf0\xe9...,24
1049,1050,Calle 1050 #1,None,66755,b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x93\x12...,19

In [324]:
# Addresses después
df_addresses

,address_id,line1,line2,zipcode,geoposition,city_id
0,6,Calle 1 #41,None,47290,POINT (-69.62084863299583 -126.94687827205927),19
1,7,Calle 2 #54,None,52776,POINT (-88.69406578940718 -16.93732734484351),18
2,8,Calle 3 #85,None,55158,POINT (-55.874011596547454 -74.45279361163527),24
3,9,Calle 4 #60,None,33987,POINT (68.49769187951244 -42.08641244292858),18
4,10,Calle 5 #21,None,27804,POINT (41.487150202958986 114.58411422985057),24
...,...,...,...,...,...,...
1045,1051,Calle 1046 #32,None,99560,POINT (89.94139725336936 -175.85387046994072),16
1046,1052,Calle 1047 #25,None,11560,POINT (54.58595212976073 61.00499924365897),25
1047,1053,Calle 1048 #67,None,58368,POINT (68.52666878935571 54.87802851468143),22
1048,1054,Calle 1049 #14,None,85524,POINT (62.45690672887201 60.890862868065824),24
1049,1055,Calle 1050 #1,None,66755,POINT (-38.03628076616328 -21.324578748386898),19

In [80]:
# User Addresses antes
df_userAddresses

     user_address_id  user_id  address_id  enabled
0                  1        1           1        1
1                  2        2           2        1
2                  3        3           3        1
3                  4        4           4        1
4                  5        5           5        1
..               ...      ...         ...      ...
995              996      996         996        1
996              997      997         997        1
997              998      998         998        1
998              999      999         999        1
999             1000     1000        1000        1

[1000 rows x 4 columns]

In [150]:
# User Addresses después
df_userAddresses

     user_address_id  user_id  address_id  enabled
0                  1        1           6        1
1                  2        2           7        1
2                  3        3           8        1
3                  4        4           9        1
4                  5        5          10        1
..               ...      ...         ...      ...
995              996      996        1001        1
996              997      997        1002        1
997              998      998        1003        1
998              999      999        1004        1
999             1000     1000        1005        1

[1000 rows x 4 columns]

In [326]:
# Insertar los userAddresses
for index, row in df_userAddresses.iterrows():
    try:
        cursor.execute("""
            INSERT INTO solturaDB.sol_usersAdresses(userID, addressID, enabled)
            VALUES (?, ?, ?);
        """, (int(row["user_id"]), int(row["address_id"]), bool(row["enabled"])))
        
    except Exception as e:
        print(f"Error migrando user_address {row['user_address_id']}: {e}")

tSqlConn.commit()

## Migración de los schedules

In [328]:
# Crear DataFrame para mapear schedule_id viejos a nuevos
scheduleIDMap = pd.DataFrame(columns=["oldScheduleID", "newScheduleID"])

for index, row in df_schedules.iterrows():
    try:
        oldScheduleID = int(row["schedule_id"])

        cursor.execute("""
            INSERT INTO solturaDB.sol_schedules(name, repit, repetitions, recurrencyType, endDate, startDate)
            OUTPUT INSERTED.scheduleID
            VALUES (?, ?, ?, ?, ?, ?);
        """, (
            str(row["name"]),
            bool(row["repit"]),
            int(row["repetitions"]),
            int(row["recurrencyType"]),
            row["endDate"] if pd.notna(row["endDate"]) else None,
            row["startDate"]
        ))

        newScheduleID = cursor.fetchone()[0]
        scheduleIDMap.loc[len(scheduleIDMap)] = [int(oldScheduleID), int(newScheduleID)]

        # Actualizar el DataFrame original
        df_schedules.at[index, "schedule_id"] = newScheduleID

    except Exception as e:
        print(f"Error migrando schedule {oldScheduleID}: {e}")
        break

tSqlConn.commit()

In [330]:
# Reemplazar schedule_id viejo con el nuevo
scheduleMap = dict(zip(scheduleIDMap["oldScheduleID"], scheduleIDMap["newScheduleID"]))
df_scheduleDetails["schedule_id"] = df_scheduleDetails["schedule_id"].map(scheduleMap)
df_userPlanPrices["schedule_id"] = df_userPlanPrices["schedule_id"].map(scheduleMap)

In [332]:
# Crear DataFrame para mapear schedules_details_id viejos a nuevos
scheduleDetailIDMap = pd.DataFrame(columns=["oldScheduleDetailID", "newScheduleDetailID"])

for index, row in df_scheduleDetails.iterrows():
    try:
        oldDetailID = int(row["schedules_details_id"])

        cursor.execute("""
            INSERT INTO solturaDB.sol_schedulesDetails(
                deleted, schedule_id, baseDate, datePart, lastExecute, nextExecute, description, detail
            )
            OUTPUT INSERTED.schedulesDetailsID
            VALUES (?, ?, ?, ?, ?, ?, ?, ?);
        """, (
            bool(row["deleted"]),
            int(row["schedule_id"]),
            row["baseDate"],
            row["datePart"],
            row["last_execute"] if pd.notna(row["last_execute"]) else None,
            row["next_execute"],
            str(row["description"]),
            str(row["detail"])
        ))

        newDetailID = cursor.fetchone()[0]
        scheduleDetailIDMap.loc[len(scheduleDetailIDMap)] = [oldDetailID, newDetailID]

        # Actualizar el DataFrame original
        df_scheduleDetails.at[index, "schedules_details_id"] = newDetailID

    except Exception as e:
        print(f"Error migrando schedule_detail {oldDetailID}: {e}")
        break

tSqlConn.commit()

### Vista de los datos

In [212]:
df_schedules

,schedule_id,name,repit,repetitions,recurrencyType,endDate,startDate
0,1,Pago Estándar Mensual,1,12,1,None,2025-04-30 06:06:52
1,2,Pago Premium Anual,0,1,2,None,2025-04-30 06:06:52

In [224]:
df_scheduleDetails

,schedules_details_id,deleted,schedule_id,baseDate,datePart,last_execute,next_execute,description,detail
0,1,0,1,2025-04-30 06:06:52,2025-01-01,None,2025-02-01,Pago mensual,Pago mensual de la suscripción Estándar
1,2,0,2,2025-04-30 06:06:52,2025-01-01,None,2026-01-01,Pago anual,Pago anual de la suscripción Premium

# Adaptación de los planes

Pay assistant va a ser migrada como un partner a soltura, con un contrato temporal donde no haya descuento ni comisión

In [334]:
from datetime import datetime, timedelta

# Instanciar IDs desde antes
partnerId = None
dealId = None

# Datos para de Payment Assistant
partnerData = {
    "name": "Payment Assistant",
    "registerDate": datetime.now(),
    "state": 1,
    "identificationtypeId": 1,
    "enterpriseSizeId": 2,
    "identification": "3-100-123654"
}

# Insertar el partner a TSQL
try:
    cursor.execute("""
        INSERT INTO solturaDB.sol_partners
        (name, registerDate, state, identificationtypeId, enterpriseSizeId, identification)
        OUTPUT INSERTED.partnerID
        VALUES (?, ?, ?, ?, ?, ?);
    """, (
        partnerData["name"],
        partnerData["registerDate"],
        partnerData["state"],
        partnerData["identificationtypeId"],
        partnerData["enterpriseSizeId"],
        partnerData["identification"]
    ))

    partnerId = cursor.fetchone()[0]

except Exception as e:
    print(f"Error insertando partner: {e}")

# Si el partner fue insertado correctamente, insertar el deal
if partnerId is not None:
    try:
        sealDate = datetime.now()
        endDate = sealDate + timedelta(days=150) # Este se va a adaptar a que dure esta cantidad de días

        cursor.execute("""
            INSERT INTO solturaDB.sol_deals
            (partnerId, dealDescription, sealDate, endDate, solturaComission, discount, isActive)
            OUTPUT INSERTED.dealID
            VALUES (?, ?, ?, ?, ?, ?, ?);
        """, (
            partnerId,
            "Beneficios de app: Payment Assistant",
            sealDate,
            endDate,
            0, 
            0,
            1  
        ))

        dealId = cursor.fetchone()[0]

    except Exception as e:
        print(f"Error insertando deal: {e}")


tSqlConn.commit()

In [ ]:
print(dealId)

### Tablas de datos de los planes de Mysql

In [234]:
df_subscriptions

   subscription_id description
0                1    Estándar
1                2     Premium

In [236]:
df_planPrices

,plan_prices_id,subscrition_Id,amount,currency_id,postTime,endDate,current
0,1,1,9.99,2,2025-04-30 06:06:52,2025-12-31,1
1,2,2,39.99,2,2025-04-30 06:06:52,2025-12-31,1

In [238]:
df_planFeaturesSubscriptions

   plan_features_id  subscription_id value  enabled
0                 1                1    No        1
1                 1                2    Sí        1
2                 2                1    50        1
3                 2                2   200        1
4                 3                1     5        1

In [247]:
df_planFeatures

   plan_features_id                              description  enabled dataType
0                 1                    Acceso a soporte 24/7        1  Boolean
1                 2        Límite de transacciones mensuales        1  Integer
2                 3  Límite de creación de pagos recurrentes        1  Integer

In [240]:
df_userPlanPrices

,user_plan_price_id,user_id,plan_prices_id,adquision,enabled,schedule_id
0,1,3,1,2025-03-28,1,1
1,2,4,1,2025-03-19,1,1
2,3,5,1,2025-04-16,1,1
3,4,6,1,2025-03-16,1,1
4,5,7,1,2025-02-08,1,1
...,...,...,...,...,...,...
1045,1046,1048,2,2025-03-12,1,2
1046,1047,1049,2,2025-04-25,1,2
1047,1048,1050,2,2025-02-12,1,2
1048,1049,1051,2,2025-02-16,1,2
1049,1050,1052,2,2025-03-25,1,2

## Migración de planes

In [338]:
planIDMap = {}

for index, row in df_subscriptions.iterrows():
    description = row["description"]
    planTypeId = 1 if description == "Estándar" else 2

    cursor.execute("""
        INSERT INTO solturaDB.sol_plans (description, planTypeId)
        OUTPUT INSERTED.planID
        VALUES (?, ?);
    """, (description, planTypeId))

    planID = cursor.fetchone()[0]
    planIDMap[int(row["subscription_id"])] = int(planID)

tSqlConn.commit()

In [340]:
# Actualizar los subscription_id en df_subscriptions y df_planPrices y df_planFeaturesSubscriptions
df_subscriptions["subscription_id"] = df_subscriptions["subscription_id"].map(planIDMap)
df_planPrices["subscrition_Id"] = df_planPrices["subscrition_Id"].map(planIDMap)
df_planFeaturesSubscriptions["subscription_id"] = df_planFeaturesSubscriptions["subscription_id"].map(planIDMap)

In [349]:
planPriceIDMap = {}

for index, row in df_planPrices.iterrows():
    planID = int(row["subscrition_Id"])
    amount = float(row["amount"])
    currency_id = int(row["currency_id"])
    postTime = row["postTime"]
    endDate = row["endDate"]


    cursor.execute("""
        INSERT INTO solturaDB.sol_planPrices (
            planID, amount, currency_id, postTime, endDate, [current]
        )
        OUTPUT INSERTED.planPriceID
        VALUES (?, ?, ?, ?, ?, ?);
    """, (planID, amount, currency_id, postTime, endDate, bool(1)))

    planPriceID = cursor.fetchone()[0]
    planPriceIDMap[int(row["plan_prices_id"])] = int(planPriceID)

tSqlConn.commit()

In [351]:
# Actualizar los plan_prices_id en df_planPrices y df_userPlanPrices
df_planPrices["plan_prices_id"] = df_planPrices["plan_prices_id"].map(planPriceIDMap)
df_userPlanPrices["plan_prices_id"] = df_userPlanPrices["plan_prices_id"].map(planPriceIDMap)

In [357]:
for index, row in df_userPlanPrices.iterrows():
    user_id = int(row["user_id"])
    plan_prices_id = int(row["plan_prices_id"])
    adquision = row["adquision"]
    enabled = int(row["enabled"])
    schedule_id = int(row["schedule_id"])

    cursor.execute("""
        INSERT INTO solturaDB.sol_userPlans (
            userID, planPriceID, adquisition, enabled, scheduleID
        )
        VALUES (?, ?, ?, ?, ?);
    """, (user_id, plan_prices_id, adquision, enabled, schedule_id))

tSqlConn.commit()

In [359]:
# Insertar "Aplicación" como tipo de feature, ya que sol_features necesita un tipo de feature
featureTypeId = None
try:
    cursor.execute("""
        INSERT INTO solturaDB.sol_featureTypes(type)
        OUTPUT INSERTED.featureTypeID
        VALUES (?);
    """, ("Aplicación",))
    featureTypeId = cursor.fetchone()[0]
    featureTypeId = int(featureTypeId)
except Exception as e:
    print(f"Error insertando tipo de feature: {e}")

In [ ]:
featureTypeId

In [363]:
# Crear el nuevo DataFrame de datos adaptado para guardar lo insertado de planFeatures
sol_planFeatures = pd.DataFrame(columns=[
    "featureID", "planFeaturesId", "dealId", "description", "unit", "consumableQuantity", 
    "enabled", "isRecurrent", "scheduleID", "featureTypeID"
])

planFeatureIdMap = {}

# Recorrer los planFeatures y cruzarlos con los planfeatureSubscriptions
for index, planFeature in df_planFeatures.iterrows():
    planFeaturesId = int(planFeature["plan_features_id"])
    description = planFeature["description"]
    unit = planFeature["dataType"]

    # Filtrar las suscripciones que tienen este feature
    relatedSubs = df_planFeaturesSubscriptions[
        df_planFeaturesSubscriptions["plan_features_id"] == planFeaturesId
    ]

    for index, sub in relatedSubs.iterrows():
        rawValue = sub["value"]

        # Convertir valor de texto a número
        if rawValue == "No":
            consumableQuantity = 0
        elif rawValue == "Sí":
            consumableQuantity = 1
        else:
            consumableQuantity = int(rawValue)

        try:
            cursor.execute("""
                INSERT INTO solturaDB.sol_planFeatures(
                    dealId, description, unit, consumableQuantity, enabled,
                    isRecurrent, scheduleID, featureTypeID
                )
                OUTPUT INSERTED.planFeatureID
                VALUES (?, ?, ?, ?, ?, ?, ?, ?);
            """, (
                dealId,
                description,
                unit,
                consumableQuantity,
                1,      # enabled
                0,      # isRecurrent
                3,      #  # scheduleID (Ejecución mensual) 
                featureTypeId
            ))

            featureId = int(cursor.fetchone()[0])

            # Guardar en DataFrame con planFeaturesId incluido
            sol_planFeatures.loc[len(sol_planFeatures)] = [
                featureId,
                planFeaturesId,
                dealId,
                description,
                unit,
                consumableQuantity,
                1,
                0,
                3,
                featureTypeId
            ]

            # Registrar el mapeo para luego adaptarlo
            planFeatureIdMap[planFeaturesId] = featureId

        except Exception as e:
            print(f"Error insertando feature {planFeaturesId}: {e}")

# Confirmar
tSqlConn.commit()

In [365]:
# Actualizar los plan_features_id en df_planFeaturesSubscriptions
df_planFeaturesSubscriptions["plan_features_id"] = df_planFeaturesSubscriptions["plan_features_id"].map(planFeatureIdMap)

In [ ]:
planFeatureIdMap

In [379]:
df_planFeaturesSubscriptions

   plan_features_id  subscription_id value  enabled
0                 9               25    No        1
1                 9               26    Sí        1
2                11               25    50        1
3                11               26   200        1
4                12               25     5        1

In [377]:
# Insertar en sol_featuresPerPlan con el campo enabled en 1
for index, row in df_planFeaturesSubscriptions.iterrows():
    try:
        cursor.execute("""
            INSERT INTO solturaDB.sol_featuresPerPlans (planFeatureID, planID, enabled)
            VALUES (?, ?, ?);
        """, (int(row["plan_features_id"]), int(row["subscription_id"]), 1))
    except Exception as e:
        print(f"Error insertando feature-plan: {row.to_dict()} -> {e}")

tSqlConn.commit()